Osmax-Br/time_keeper_esp32/main.cpp
      http.addHeader("Content-Type", "application/x-www-form-urlencoded"); //Specify content-type header
     
     char post_message[2000] ; //storing the post message                                                                                                                                                                                                                                //rtc.getTime("%I:%M:%S %p %a %d/%m")
     // should change the values in the next line to varaibles
     sprintf(post_message,"chosen_activity=%s&hours_passed=%i&minutes_passed=%i&seconds_passed=%i&activity_date_month=%i&activity_date_day_number=%i&activity_date_weekday=%s&activity_date_hour=%s&activity_date_minute=%s&activity_date_year=%i",str[page][activity],data_storage[page][activity][2],data_storage[page][activity][1],data_storage[page][activity][0],month_of_upload,day_of_upload,rtc.getTime("%a"),rtc.getTime("%H"),rtc.getTime("%M"),year_of_upload);
      int httpResponseCode = http.POST(post_message);   
      if(httpResponseCode>0){
  
    String response = http.getString();  //Get the response to the request
    Serial.println(response);
    }
    Serial.print(httpResponseCode);
    /* else{
          last_select_mode = select_mode;
          select_mode = 5;
          error_message_text = "error during upload";
          options_select_mode = 0;
          last_press_time = millis();
      }*/
      http.end();
    }}

String get(){
  String return_var = "";
      if(WiFi.status() != WL_CONNECTED){
          buzzer_tone_select = "error";
          last_select_mode = select_mode;
          select_mode = 5;
          error_message_text = "connect to wifi";
          options_select_mode = 0;
          last_press_time = millis();

    }
if(WiFi.status()== WL_CONNECTED){
      HTTPClient http;

      String serverPath = sql_server;
      
      // Your Domain name with URL path or IP address with path
      http.begin(serverPath.c_str());
      // Send HTTP GET request
      int httpResponseCode = http.GET();
      if (httpResponseCode>0) {
      
        String payload = http.getString();
        return_var = payload ;
      
      }
      else {
        
      }
      // Free resources
      http.end();
    }

  return return_var;

}





void web_server(){
  
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/html", index_html, var_processor);
  });
  
  server.on("/timer", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/plain", timer_web_var().c_str());
  });
   server.on("/chosen_server", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/plain", chosen_value_web_var().c_str());
  });
    server.on("/Pause", HTTP_GET, [] (AsyncWebServerRequest *request) {
    request->send(200, "text/plain", "ok");
  });
  server.on("/btn", HTTP_GET, [](AsyncWebServerRequest *request){
    request->send_P(200, "text/plain", pause_web_var().c_str());
  });
  server.on("/Resume", HTTP_GET, [] (AsyncWebServerRequest *request) {
    request->send(200, "text/plain", "ok");
  });
   server.on("/PauseBtn", HTTP_GET, [] (AsyncWebServerRequest *request) {
    if(paused==true && chosen_value != "Nothing"){
        paused = false;
        buzzer_tone_select = "resume";
      }
    else if(paused == false){
        paused = true;
        buzzer_tone_select = "pause";
      } 
    
    request->send(200, "text/plain", "ok");
  });
  server.on("/choseee", HTTP_GET, [] (AsyncWebServerRequest *request) {
    String inputMessage = "";
    String inputParam;
    // GET input1 value on <ESP_IP>/get?input1=<inputMessage>
    if(wifi_set_mode == false){
    if (request->hasParam("input1")) {
      inputMessage = request->getParam("input1")->value();
      inputParam = "input1";
     int chosen_value_index = 0; // for chosing the value index from str array (activity) 
      for(int i =0 ; i<12 ;i++){
      if(str[3][i] == "/"){
        chosen_value_index = i;
        break;
     }}
    // must put semaphore
    current_page = 3 ;
    str[3][chosen_value_index] = inputMessage;
    chosen_value = str[3][chosen_value_index];
      }}
    else if(wifi_set_mode == true ){
        if(ssid_set == true){
    if (request->hasParam("input1")) {
      inputMessage = request->getParam("input1")->value();
      inputParam = "input1";
      ssid_ = inputMessage ;
      ssid_set = false;
      }}
    else if(ssid_set == false){
    if (request->hasParam("input1")) {
      inputMessage = request->getParam("input1")->value();
      inputParam = "input1";
      password_ = inputMessage ;
      password_set = true;
      //ssid_set = true;
      }        



    }}
    request->send(200, "text/html", " <meta http-equiv='refresh' content='0; URL=http://192.168.1.199/'> ");
  });
 
  server.begin();
}



String partition_time(long time){
  long hours = time/3600;
  long minutes = (time - (hours * 3600))/60 ; 
  long seconds = time - (hours*3600 + minutes*60) ;
  char return_value[200];
  sprintf(return_value,"%02i:%02i:%02i",hours,minutes,seconds);
  Serial.println(time);
  return return_value;
}




int last_buzzer_time = 0;

// error message function
void error_message(String error_text_message,int last_select_mode){
  
  if(select_mode == 5){
  rgb_display(0);
  display.setTextSize(1);
  display.setTextColor(WHITE);
  display.setCursor(0,0);
  display.print(error_text_message);
  display.drawRect(40,45,50,15,WHITE); 
  display.setCursor(60,48);
  display.print("ok");
  display.display();
  
  
  if(selecT == "pressed" && millis() > last_press_time + 100){
    //error_buzzer_on = false;
    display.clearDisplay();
    select_mode = last_select_mode;
    last_select_mode = 0;
    last_press_time = millis();
    return ;
  }
}}




void ir_button(){//32086590080
    if(IrReceiver.decodedIRData.decodedRawData == 3208659008){ 
  
