Osmax-Br/time_keeper_esp32/main.cpp
  if(ir_long_press == false){
  ir_long_press = true;
  last_time_long_press_mode = millis();
  IrReceiver.decodedIRData.decodedRawData = 0;
  }
  else if(ir_long_press == true){
  ir_long_press = false;
  IrReceiver.decodedIRData.decodedRawData = 0;
  }
  

}




if(ir_long_press == false){
  temp_button_return = "pressed";
  rgb_display(7);
  
}
else{
  temp_button_return = "long_pressed";
  rgb_display(4);
  
}


if(millis() > last_time_long_press_mode + 10000 && ir_long_press == true){
    rgb_display(7);
    last_time_long_press_mode = millis();
    ir_long_press = false;
}
//Serial.print(temp_button_return);


if(IrReceiver.decodedIRData.decodedRawData == 4060954688){ 
  selecT = temp_button_return;
  if(temp_button_return = "long_pressed"){
    ir_long_press = 0;
  }
  IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 4094378048){
        up = temp_button_return; 
          if(temp_button_return = "long_pressed"){
            ir_long_press = 0;}
        IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 4044243008){
        down = temp_button_return;
          if(temp_button_return = "long_pressed"){
          ir_long_press = 0;} 
        IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 3994107968){
        right = temp_button_return; 
        if(temp_button_return = "long_pressed"){
        ir_long_press = 0;}
        IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 4010819648){
        left = temp_button_return; 
        if(temp_button_return = "long_pressed"){
        ir_long_press = 0;
  }
        IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 3910549568){
        paused = true;
        buzzer_tone_select = "pause";
        IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 3893837888){
  if(chosen_value != "Nothing"){
        paused = false;
        buzzer_tone_select = "resume";}
        IrReceiver.decodedIRData.decodedRawData = 0;
}
if(IrReceiver.decodedIRData.decodedRawData == 3877126208){
        if(paused == true){
          buzzer_tone_select = "pause";
        }
        else if (paused== false){
          buzzer_tone_select = "resume";
        }
        IrReceiver.decodedIRData.decodedRawData = 0;
}


// red 39105495680
// gre 3893837888
// yellow 38771262080



  if (IrReceiver.decode()) {

      //Serial.println(IrReceiver.decodedIRData.decodedRawData);
      // USE NEW 3.x FUNCTIONS
       //IrReceiver.printIRResultShort(&Serial); // Print complete received data in one line
      // IrReceiver.checkForRepeatSpaceTicksAndSetFlag(10);
       //IrReceiver.checkForRecordGapsMicros(&Serial);
     // IrReceiver.printIRSendUsage(&Serial);   // Print the statement required to send this data
      IrReceiver.resume(); // Enable receiving of the next value
  } 

}





void get_ntp_time( void * pvParameters ){ //get time data from ntp
    for(;;) {
    if((WiFi.status() == WL_CONNECTED && rtc_time_updated == false) || (WiFi.status() == WL_CONNECTED && rtc_time_updated == true && millis() > last_rtc_update + 86400)){
    // getting the time from ntp server
  configTime(7200,0, "pool.ntp.org");   // utc offset , daylight saving , ntp server
  struct tm timeinfo;
  if (getLocalTime(&timeinfo)){
    rtc.setTimeStruct(timeinfo); // set the rtc time from ntp
    rtc_time_updated = true ; // dont reconntect to ntp servers
    last_rtc_update = millis();
  }
      

    }
  }
}



void IRAM_ATTR onTimer() {      //Defining Inerrupt function with IRAM_ATTR for faster access
if(paused == false && chosen_value != "Nothing"){
 portENTER_CRITICAL_ISR(&timerMux); // for stopping other functions of changing this value at the same time
 data_storage[current_page][data_storage_index][0] ++ ;
 portEXIT_CRITICAL_ISR(&timerMux);
}}



void connect_wifi(){
  if (!WiFi.config(local_IP, gateway, subnet, primaryDNS, secondaryDNS)) {  // ensuring no error happened
  }
  display.print("connecting.......");
  display.display();
  connection_begin = millis();  //for timing out
     if(WiFi.status() != WL_CONNECTED){
      while(WiFi.status() != WL_CONNECTED && millis() <= connection_begin+20000){
        WiFi.begin(ssid, password);
        break;    
      } 
     
    }


}

void draw_grid(){ //used this method for easier tex inverting 
  for(int i = 0 ; i<4 ; i++){
    for(int j=0 ; j<3 ; j++){
    display.drawRect(rect_cord[i][j][0],rect_cord[i][j][1],rect_cord[i][j][2],rect_cord[i][j][3], WHITE);
  }}
}




void print_label(int current_page,int filled_rect_x , int filled_rect_y) { //printing the activity inside its box in the grid
  draw_grid();
  display.setTextSize(1);
  int i2=0; //this is to adjust the y shift while printing labels
  for(int i=0;i<12;i++){  
  int _x = table[i][0]; // getting the coordintaes of each rectangular
  int _y = table[i][1];  
  if(i==9){
    i2 = -2;  //adjusting y shift
  }
  display.setCursor(4 + 41 * _x,3 + (17 * _y) +i2); //setting writing cursor
  if(_x == filled_rect_x && _y==filled_rect_y){ //&& selecT_bounce == 1){   //this is for inverting the text color while selecting
  display.setTextColor(BLACK);
  display.print(str[current_page][i].substring(0,6));} //printing the labels
  else{
 display.setTextColor(WHITE);
  display.print(str[current_page][i].substring(0,6));
  }
  }
}

void grid_navigiation(){
    select_mode = 1;
    int x = cursor[0]; // getting current cursor coordintes
    int y = cursor[1];
  if(right == "pressed"){
    if(cursor[0] + 1 != 3){ //this is for checking the the cursor doesnt go out of the screen (stops at the edges)
    cursor[0] = cursor[0] + 1; // adjusting x cursor
    display.clearDisplay(); // clearing display for interferance
  }}

   if(left == "pressed"){
    if(cursor[0] -1  != -1){
    cursor[0] = cursor[0] - 1; 
    display.clearDisplay();
  }} 
   if(up == "pressed"){
    if(cursor[1] -1  != -1){
    cursor[1] = cursor[1] - 1; 
    display.clearDisplay();
  }} 
   if(down == "pressed"){
    if(cursor[1] +1  != 4){
    cursor[1] = cursor[1] + 1 ; 
    display.clearDisplay();
  }} 
    display.clearDisplay(); //without it the lables will over lap
    display.fillRect(rect_cord[y][x][0],rect_cord[y][x][1],rect_cord[y][x][2],rect_cord[y][x][3], WHITE); //making the rectangular white (needed to swap the x&y because of typing error)



if(selecT == "pressed"){ //the action which happens when something is selected
int x = cursor[0]; //the same code used in the function print_label
int y = cursor[1]; //the code is mainly to change from coordinates in cusor to a number which allows us to know the value selected

