Osmax-Br/time_keeper_esp32/main.cpp
for(int i=0 ; i<12 ; i++){
  int x1 = table[i][0];
  int y1 = table[i][1];
  if(x1==x && y==y1){
    
    chosen_value = str[current_page][i]; //the Actual selected value 
    data_storage_index = i ; //for knowing wher to store time data
    select_mode = 0;
    break;
  }
}

}

if(right == "long_pressed" && current_page != 3){ //for flipping pages and ensuring that an error doesnt happen
  current_page +=1 ;   // change page
}
if(left == "long_pressed" && current_page != 0){
  current_page -=1 ;   // change page 
}

print_label(current_page,cursor[0],cursor[1]); // printing the lables
}



void main_screen(){


 // rgb_display(7);
 display.clearDisplay();
 display.setTextColor(WHITE);
  display.setCursor(45,53);
  display.setTextSize(1);
 //display.print("choice: ");
  if(chosen_value=="Nothing"){
    display.print("Nothing");
    }
  else{

    display.print(chosen_value);
    } 
  display.setFont(NULL);  
  display.setCursor(17,0+15);
  display.setTextSize(2);
  display.print(time_counter_string);
  display.setTextSize(1);
  display.setCursor(0,20+15);
  if(rtc_time_updated == true){
 display.print(rtc.getTime("%I:%M:%S %p %a %d/%m")); //printing current time from the rtc
  }
  else{
    display.print("Error! cant get time"); 
  }
 



 if(selecT == "pressed" && chosen_value=="Nothing" && millis() > last_press_time + 100){
    last_select_mode = select_mode;
    select_mode = 5;
    buzzer_tone_select = "error";
    error_message_text = "choose something";
    last_press_time = millis();
  }

  display.display();
}


void screen_off(){

 if((right=="pressed" || left == "pressed" || up == "pressed" || down == "pressed" || selecT == "pressed")){  // wake the screen up
  //for not interfering with the grid selection
  display.ssd1306_command(SSD1306_DISPLAYON);
  if(select_mode == 3){
  select_mode = 0;    // back to main screen
  }
  last_time_screen_on = millis();
  }  
if(last_time_screen_on+saves_screen_off_time<millis() && time_critical == false){  // change the auto display_off time 
  select_mode = 3; // that means the screen is off
  display.ssd1306_command(SSD1306_DISPLAYOFF); // switch the display off
  options_select_mode = 0;
  }  
}


void counter_formatting(){
  
if(data_storage[current_page][data_storage_index][0] > 59){
  portENTER_CRITICAL(&timerMux);
  data_storage[current_page][data_storage_index][0] = 0;
  portEXIT_CRITICAL(&timerMux);
  data_storage[current_page][data_storage_index][1] ++ ;
}
if(data_storage[current_page][data_storage_index][1] == 59){
  data_storage[current_page][data_storage_index][1] = 0;
  data_storage[current_page][data_storage_index][2] ++ ;
}
sprintf(time_counter_string,"%02i:%02i:%02i",data_storage[current_page][data_storage_index][2],data_storage[current_page][data_storage_index][1],data_storage[current_page][data_storage_index][0]);

}

void temp_screen(){
  display.clearDisplay();

  if(millis() > last_temp_update + 2000){
    humidity = dht.readHumidity();
    temperature = dht.readTemperature();
    heat_index = dht.computeHeatIndex(temperature, humidity, false);
    last_temp_update = millis();
}

//sprintf(temp_temp_print,"I %.01f C%c , H %.01f %%",heat_index,(char)247,humidity);
    display.setCursor(0,0);
    display.setTextSize(1);
    display.print("TEMP  ");
    display.setTextSize(2);
    display.printf("%.01f C%c",temperature,(char)247);
    display.setCursor(0,25);
    display.setTextSize(1);
    display.print("HUMID  ");
    display.setTextSize(2);
    display.printf("%.01f %%",humidity);
    display.setCursor(0,50);
    display.setTextSize(1);
    display.print("INDEX ");
    display.setTextSize(2);
    display.printf("%.01f C%c",heat_index,(char)247);
    if(heat_index >= 30){
        rgb_display(0);
    }
    else{
        rgb_display(1);
    }
    display.display();
}





String buzzer_on_off(bool state){
  if(state == true){
    return "On";
  }
  else if(state == false){
    return "Off";
  }

}


void buzzer_change_state(bool state,const char* key){
  if(state == true){
    //saves.putBool(key,false);
    
    state = false;
    Serial.print(state);
  }
  else if(state == false){
  //  Serial.println("switch");
  //saves.putBool(key,true);
    state = true;
    Serial.print(state);
  }
}

void drop_screen(){
  if(options_select_mode == 0){ // main options menu
  display.setTextSize(1);
  // rect loop
  for(int i =0 ;i<=4 ; i++){
    if(i==block_cursor){  // fill the rect white when cursor passes
      display.fillRect(0,16*i,110,16,WHITE);
    }
    else{
      display.drawRect(0,16*i,110,16,WHITE);}
      }
  int options_inner_counter = 0;   // internal var only , for inverting text color
  //text loop
  for(int i=5;i<=50;i+=15){
     display.setCursor(9,i+1);
     if(options_inner_counter == block_cursor){ //when cursor passes make rect text black
      display.setTextColor(BLACK);
     }
     else{
      display.setTextColor(WHITE);  // inverting text
     }
    display.print(options_list[options_outer_counter][options_inner_counter]);  // print option labels
    options_inner_counter++;  // print next label inside the same page
    }
  
  
  for(int i=0 ; i <=64 ; i+=8){   // the dots
    display.fillRect(122,i,2,2,WHITE);
          }
// move up
  if(up == "pressed"){
    if(options_outer_counter + block_cursor != 0){  //for not going outside the screen
    block_cursor --;}// move up


    if(block_cursor == -1  && scroll_bar_place !=1){  // change page
      block_cursor = 3; //the last option of the previous page
    scroll_bar_place -= 10; // change the scroll_bar
    options_outer_counter--;} // change page
  }

// move down (same way)
  if(down == "pressed"){
    if(options_outer_counter == 3 && block_cursor ==3){

    }
    else{
    block_cursor ++ ;}
    if(block_cursor == 4  && scroll_bar_place != 31 && options_outer_counter != 4){
      block_cursor = 0;
    scroll_bar_place += 10; 
    options_outer_counter++;}
  }
  display.fillRoundRect(120,scroll_bar_place,5,20,5,WHITE);} // print the actual scroll bar
  



 // if(selecT == "pressed" && options_outer_counter == 0 && block_cursor == 0 && options_select_mode == 0){ //entering the first option
   // options_select_mode = 1;  // each one represents an option 
   // last_press_time = millis(); // for not regestring multiple presses
  //}
 
