Osmax-Br/time_keeper_esp32/main.cpp
  }

if(options_select_mode == 12){
  display.clearDisplay();
  if(select_mode == 4 && right == "pressed" && options_select_mode == 12 && current_rgb != 7){
   current_rgb ++;
}
if(select_mode == 4 && options_select_mode == 12 && left == "pressed" && current_rgb != 0){
   current_rgb --;
}
  rgb_display(current_rgb);
  display.setCursor(30,10);
  display.setTextColor(WHITE);
  display.setTextSize(2);
  display.print(rgb_values_name[current_rgb]);
  display.setCursor(15,40);
  display.setTextSize(1);
  display.printf("(%i ,  %i ,  %i)",rgb_values[current_rgb][0],rgb_values[current_rgb][1],rgb_values[current_rgb][2]);
  display.display();
}


int address_num1 = 1;
int address_num2 = 11;
if(options_select_mode == 8){
    display.setCursor(30,0);
    display.setTextSize(1);
    display.setTextColor(WHITE);
    display.print("192.168.");
    display.setTextSize(2);
    display.print("1.11");

}



if(options_select_mode == 11){
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("do you want to reset?");
    display.setCursor(23, 15);
    display.setFont(&FreeMonoBoldOblique9pt7b);
    display.print(chosen_value);
    display.setFont(&FreeMono9pt7b);
    display.setCursor(20, 40);
    display.printf("%02i:%02i:%02i",data_storage[current_page][data_storage_index][2],data_storage[current_page][data_storage_index][1],data_storage[current_page][data_storage_index][0]);
    display.setFont(NULL);
    if(ok_cancel_button == false){
    display.fillRoundRect(20, 45, 40, 15, 3, WHITE);
    display.setCursor(23, 48);
    display.setTextColor(BLACK);
    display.print("Cancel");
    display.setTextColor(WHITE);
    display.drawRoundRect(70, 45, 40, 15, 3, 1);
    display.setCursor(84, 48);
    display.print("ok");}
    else if(ok_cancel_button == true){
    display.drawRoundRect(20, 45, 40, 15, 3, 1);
    display.setCursor(23, 48);
    display.setTextColor(WHITE);
    display.print("Cancel");
    display.fillRoundRect(70, 45, 40, 15, 3,WHITE);
    display.setCursor(84, 48);
    display.setTextColor(BLACK);
    display.print("ok");
    }




    if(left == "pressed" && ok_cancel_button == true){
      ok_cancel_button = false;
    }
    if(right == "pressed" && ok_cancel_button == false){
      ok_cancel_button = true;
    }

    if(ok_cancel_button == false && selecT == "pressed" && millis() > last_press_time + 100){
      ok_cancel_button = true;
      last_press_time = millis();
      options_select_mode = 0;
    }
    else if(ok_cancel_button == true && selecT == "pressed"&& millis() > last_press_time + 100){
      if(chosen_value == "Nothing"){
          last_select_mode = select_mode;
          select_mode = 5;
          error_message_text = "choose an activity";
          buzzer_tone_select = "error";
          options_select_mode = 11;
          last_press_time = millis();
      }
      else{
       portENTER_CRITICAL_ISR(&timerMux); // for stopping other functions of changing this value at the same time
       data_storage[current_page][data_storage_index][0] = 0 ;
       data_storage[current_page][data_storage_index][1] = 0 ;
       data_storage[current_page][data_storage_index][2] = 0 ;
       portEXIT_CRITICAL_ISR(&timerMux);
       paused = true ;
       buzzer_tone_select = "pause";
       last_press_time = millis();
       options_select_mode = 0;
      }

    }


    display.display();
}

if(options_select_mode == 2){
    if(time_partitioned == false){
    String gmt_offset_string = partition_time(gmt_offset);
    gmt_offset_minutes = gmt_offset_string.substring(3,5).toInt();
    gmt_offset_hours = gmt_offset_string.substring(0,2).toInt();
    time_partitioned = true;
    }
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("     GMT offset");
    display.setCursor(20, 15);
    display.setTextSize(3);
    display.printf("%02i:%02i",gmt_offset_hours,gmt_offset_minutes);
    if(up == "pressed"){
        if(ok_cancel_button == false && gmt_offset_hours < 12){  //change minutes
            gmt_offset_hours ++ ;
        }
        if(ok_cancel_button == true && gmt_offset_minutes <= 59){  //change minutes
            gmt_offset_minutes ++ ;
        }
        if(gmt_offset_minutes == 60){
          gmt_offset_minutes = 0;
          if(gmt_offset_hours < 12){
         gmt_offset_hours ++ ;}
        }
    }

    if(down == "pressed"){
        if(ok_cancel_button == true && gmt_offset_minutes > 0){  
            gmt_offset_minutes -- ;
        }
        if(ok_cancel_button == false && gmt_offset_hours > -12){  
            gmt_offset_hours -- ;
        }

    }    

    if(ok_cancel_button == false){
    display.drawLine(25, 40, 50, 40, 1);
    }
    else{
    display.drawLine(75, 40, 100, 40, 1);
    }
    display.setTextSize(1);
    display.drawRoundRect(42, 48, 40, 15, 5, 1);
    display.setCursor(57, 51);
    display.print("ok");
    display.display();
    
    
    
    if(left == "pressed" && ok_cancel_button == true){
      ok_cancel_button = false;
    }
    if(right == "pressed" && ok_cancel_button == false){
      ok_cancel_button = true;
    }

    if(selecT == "pressed" && millis() > last_press_time + 100){
        time_partitioned = false;
        gmt_offset = gmt_offset_hours*3600 + gmt_offset_minutes*60 ;
        rtc.offset = gmt_offset ;
        saves.putLong("gmt_offset",gmt_offset);
       // Serial.println(gmt_offset);
        last_press_time = millis();
        options_select_mode = 0;
    }




}



if(options_select_mode == 8){
    if(time_partitioned == false){
    String screen_off_time_string = partition_time(saves_screen_off_time/1000);
    screen_off_seconds = screen_off_time_string.substring(6,8).toInt();
    screen_off_minutes = screen_off_time_string.substring(3,5).toInt();
    time_partitioned = true;
    }
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("   screen off time");
    display.setCursor(20, 15);
    display.setTextSize(3);
    display.printf("%02i:%02i",screen_off_minutes,screen_off_seconds);
    if(up == "pressed"){
        if(ok_cancel_button == false && screen_off_minutes < 3){  //change minutes
            screen_off_minutes ++ ;
        }
        if(ok_cancel_button == true && screen_off_minutes <= 59){  //change minutes
            screen_off_seconds ++ ;
        }
        if(screen_off_seconds == 60){
          screen_off_seconds = 0;
          if(screen_off_minutes < 3){
          screen_off_minutes ++ ;}
        }
    }

    if(down == "pressed"){
        if(ok_cancel_button == false && screen_off_minutes > 0){  //change minutes
            screen_off_minutes -- ;
        }
        if(ok_cancel_button == true && screen_off_seconds > 0){  //change minutes
            screen_off_seconds -- ;
        }

