Osmax-Br/time_keeper_esp32/main.cpp
    }    

    if(ok_cancel_button == false){
    display.drawLine(25, 40, 50, 40, 1);
    }
    else{
    display.drawLine(75, 40, 100, 40, 1);
    }
    display.setTextSize(1);
    display.drawRoundRect(42, 48, 40, 15, 5, 1);
    display.setCursor(57, 51);
    display.print("ok");
    display.display();
    
    
    
    if(left == "pressed" && ok_cancel_button == true){
      ok_cancel_button = false;
    }
    if(right == "pressed" && ok_cancel_button == false){
      ok_cancel_button = true;
    }

    if(selecT == "pressed" && millis() > last_press_time + 100){
        saves_screen_off_time = ((screen_off_minutes*60) + screen_off_seconds)*1000;
        if(saves_screen_off_time < 5000){
            saves_screen_off_time = 30000;
            last_select_mode = select_mode;
            select_mode = 5;
            error_message_text = "minimum value is \n      5 seconds !";
            buzzer_tone_select = "error";
            options_select_mode = 0;
            last_press_time = millis();
            time_partitioned = false;
        }
        else if(saves_screen_off_time >= 5000){
        saves.putUInt("screen_off_time",saves_screen_off_time);
        Serial.println(saves_screen_off_time);
        last_press_time = millis();
        time_partitioned = false;
        options_select_mode = 0;}
    }

}



if(options_select_mode == 14){
    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 0);
    display.println("Esp 32 internal temp");
    display.setCursor(0, 20);
    display.setTextSize(3);
    display.printf("%.01f C%c",(temprature_sens_read() - 32)/1.8,(char)247);
    display.display();
}

if(options_select_mode == 15){
  if(up == "pressed" && buzzer_settings_cursor != 0){
    buzzer_settings_cursor --;
  }
  if(down == "pressed" && buzzer_settings_cursor != 3){
    buzzer_settings_cursor ++;
  }






    display.clearDisplay();
    display.setTextColor(WHITE);
    display.setTextSize(1);
    display.setFont(NULL);
    display.setCursor(0, 2);
    display.println("Buzzer always : ");



    if(buzzer_settings_cursor == 0){
    display.fillRoundRect(90, 0, 38, 12, 3, WHITE);
    display.setCursor(100, 2);
    display.setTextColor(BLACK);
    display.print(buzzer_on_off(buzzer_always_on));}
    else{
    display.drawRoundRect(90, 0, 38, 12, 3, WHITE);
    display.setCursor(100, 2);
    display.setTextColor(WHITE);
    display.print(buzzer_on_off(buzzer_always_on));
    }



    display.setTextColor(WHITE);
    display.setCursor(0, 17);
    display.print("error sound   :");




    if(buzzer_settings_cursor == 1){
    display.fillRoundRect(90, 15, 38, 12, 3, 1);
    display.setCursor(100, 17);
    display.setTextColor(BLACK);
    display.print(buzzer_on_off(buzzer_error_sound));}
    else{
    display.drawRoundRect(90, 15, 38, 12, 3, 1);
    display.setCursor(100, 17);
    display.setTextColor(WHITE);
    display.print(buzzer_on_off(buzzer_error_sound));
    }




    display.setTextColor(WHITE);
    display.setCursor(0, 32);
    display.print("pause/resume  :");


    if(buzzer_settings_cursor == 2){
    display.fillRoundRect(90, 30, 38, 12, 3, 1);
    display.setCursor(100, 32);
    display.setTextColor(BLACK);
    display.print(buzzer_on_off(buzzer_pause_sound));
    }
    else{
    display.drawRoundRect(90, 30, 38, 12, 3, 1);
    display.setCursor(100, 32);
    display.setTextColor(WHITE);
    display.print(buzzer_on_off(buzzer_pause_sound));
    }
    





    display.setTextColor(WHITE);
    display.setCursor(0, 47);
    display.print("press sound   :");



if(buzzer_settings_cursor == 3){
    display.fillRoundRect(90, 45, 38, 12, 3, 1);
    display.setCursor(100, 47);
    display.setTextColor(BLACK);
    display.print(buzzer_on_off(buzzer_press_sound));
}
else{
    display.drawRoundRect(90, 45, 38, 12, 3, 1);
    display.setCursor(100, 47);
    display.setTextColor(WHITE);
    display.print(buzzer_on_off(buzzer_press_sound));
}
    
if(left == "pressed" || right == "pressed"){
    if(buzzer_settings_cursor == 0){
       if(buzzer_always_on == true){
        buzzer_always_on = false;
        saves.putBool("b_always_on",false);
        }
        else if(buzzer_always_on == false){
          buzzer_always_on = true;
          saves.putBool("b_always_on",true);
        }
    }
    else if(buzzer_settings_cursor == 1){
       // buzzer_change_state(buzzer_error_sound,"b_error_sound");
       if(buzzer_error_sound == false){
        buzzer_error_sound = true;
       }
       else if(buzzer_error_sound == true){
        buzzer_error_sound = false;
       }
         saves.putBool("b_error_sound",buzzer_error_sound);
    }
    else if(buzzer_settings_cursor == 2){
       // buzzer_change_state(buzzer_pause_sound,"b_pause_sound");
        if(buzzer_pause_sound == false){
        buzzer_pause_sound = true;
       }
       else if(buzzer_pause_sound == true){
        buzzer_pause_sound = false;
       }
         saves.putBool("b_pause_sound",buzzer_pause_sound);
    }   
    else if(buzzer_settings_cursor == 3){
      if(buzzer_press_sound == false){
        buzzer_press_sound = true;
       }
       else if(buzzer_press_sound == true){
        buzzer_press_sound = false;
       }
       // buzzer_change_state(buzzer_press_sound,"b_press_sound");
        saves.putBool("b_press_sound",buzzer_press_sound);
    }       



}    

    display.display();
}



if(options_select_mode == 5){
  wifi_set_mode = true;
  if(up == "long_pressed" || (password_set == true)){
    ssid_set = true;
    password_set = false;
    wifi_set_mode = false;
    Serial.printf("%s , %s \n",ssid_,password_);
    options_select_mode = 0;
  }
  
}


if(options_select_mode >= 2 && options_select_mode != 12 && options_select_mode != 11 && options_select_mode != 8 && options_select_mode!= 2 && options_select_mode!= 14 && options_select_mode != 5 && options_select_mode != 15){
    last_select_mode = select_mode;
    select_mode = 5;
    error_message_text = "not done yet";
    buzzer_tone_select = "error";
    options_select_mode = 0;
    last_press_time = millis();
}




