Osmax-Br/time_keeper_esp32/main.cpp
}

















void setup() {
  
  sprintf(time_counter_string,"%02i:%02i:%02i",data_storage[current_page][data_storage_index][2],data_storage[current_page][data_storage_index][1],data_storage[current_page][data_storage_index][0]);  // for initilizing the counter string

  Serial.begin(115200);
  display.begin(SSD1306_SWITCHCAPVCC, 0x3C);
  display.clearDisplay();
  display.setTextSize(1);
  display.setTextColor(WHITE,BLACK);
  display.setCursor(0,0);
  pinMode(4,OUTPUT);
  pinMode(PIN_RED,   OUTPUT);
  pinMode(PIN_GREEN, OUTPUT);
  pinMode(PIN_BLUE,  OUTPUT);
  pinMode(buzzerpin,OUTPUT);

  timer = timerBegin(0, 80, true);           	// timer 0, prescalar: 80, UP counting
  timerAttachInterrupt(timer, &onTimer, true); 	// Attach interrupt
  timerAlarmWrite(timer,1000000, true);  		// Match value= 1000000 for 1 sec. delay.
  timerAlarmEnable(timer);           			// Enable Timer with interrupt (Alarm Enable)


  //connecting to wifi , the ip address is 192.168.1.199
    connect_wifi();
    display.clearDisplay();

 
   xTaskCreatePinnedToCore(get_ntp_time,"ntp_time",10000,NULL,0,&ntp_time,1); // create a seperate task for getting the ntp time
  xTaskCreatePinnedToCore(buzzer_tone_function,"buzzer_tone",10000,NULL,0,&buzzer_tone,1); // create a seperate task for buzzer tones
   if(WiFi.status() == WL_CONNECTED && server_started == false){
   web_server();
   server_started = true ;
   }

   IrReceiver.begin(14, ENABLE_LED_FEEDBACK);
   
   dht.begin();

    saves.begin("settings", false);
   //settings values init
   saves_screen_off_time = saves.getUInt("screen_off_time", 30000); // in micro-seconds
   rtc.offset = gmt_offset = saves.getLong("gmt_offset", 3600); // in seconds
   buzzer_always_on = saves.getBool("b_always_on",true);
   buzzer_error_sound = saves.getBool("b_error_sound",false);
   buzzer_pause_sound = saves.getBool("b_pause_sound",true);
   buzzer_press_sound = saves.getBool("b_press_sound",true);
   
}




void loop() {
counter_formatting();
// adding the value of each button to a seperate var
up = button_up.press();
down = button_down.press();
right = button_right.press();
left = button_left.press();
selecT = button_selecT.press(); // the name is with "T" not "t" due to interferance with another library :p
ir_button();  

if(selecT == "pressed" || down == "pressed" || up == "pressed" || right == "pressed" || left == "pressed"){
  rgb_display(6);
  buzzer_tone_select = "one_time_short";
}
if(selecT == "long_pressed" || down == "long_pressed" || up == "long_pressed" || right == "long_pressed" || left == "long_pressed"){
  rgb_display(2);
  buzzer_tone_select = "one_time_long";
  //resume_tone(buzzerpin);
}



// adding the values of bounce press vars
selecT_bounce = button_selecT.bounce_press(); 

if(selecT == "long_pressed" ){ //this is for entering the grid mode or main screen
  if(select_mode == 1){
    select_mode = 0;
  }
  else if(select_mode == 0){
    select_mode = 1;
  }
}


if(select_mode == 0 && right == "long_pressed"){
    select_mode = 6;
}
if(select_mode == 6 && left == "long_pressed"){
    select_mode = 0;

}


if(select_mode == 6){
  temp_screen();
}



if (select_mode == 1){
  select_mode = 0;
  grid_navigiation(); // the grid navigiation & selection & invertion function
}
else if(select_mode == 0){
  main_screen();
  if(selecT == "pressed" && (select_mode == 0 || select_mode == 1) && chosen_value != "Nothing"){ // pressing sclect while screen is off doesnt change pause value (select_mode 3)
    if(paused == false){
      paused = true;
      buzzer_tone_select = "pause";
    }
  else if(paused == true){
    paused = false;
    buzzer_tone_select = "resume";
  }  
  }
}
else if(select_mode == 4) {
  display.clearDisplay();
  drop_screen();
} 

if(WiFi.status() != WL_CONNECTED && millis() > connection_begin + 3600000){ // if wifi isnt connected , try to connect every 1 hour
  connect_wifi();
}
 
 if(down == "long_pressed" && select_mode == 0){
  select_mode = 4;
 }
 else if(select_mode == 4 && up == "long_pressed"){
  if(options_select_mode == 0){
    select_mode = 0;
  }
  else{
    options_select_mode = 0;
  }
  
 }


screen_off();

if(WiFi.status() == WL_CONNECTED && server_started == false){
   web_server();
   server_started = true;
}

   

if(select_mode == 5){
  display.clearDisplay();
  error_message(error_message_text,last_select_mode);
} 



//Serial.print(current_rgb);
display.display();
}
 